gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_freertos_event_spi_cm33/source/freertos_event.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "timers.h"
#include "event_groups.h"
#include "semphr.h"

/* Freescale includes. */
#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"
#include "app.h"
#include "pmic_support.h"
#include "pmic_pca9422.h"
#include "glf70583.h"

#include "fsl_spi.h"
#include <string.h>
#include <stdlib.h>

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define USE_EVENT 1
#define USE_SEMAPHORE 0

#define SCAN_I2C_ADDRESS_ENABLE 1

/*======<SPI>=======*/
#define FIXED_BUFFER_SIZE (4)
#define NUM_FRAMES (3)

#define MAX_FRAME_SIZE 64
#define TRIGGER_HEX_VALUE 0x92
#define TRIGGER_FRAME2_VALUE 0x23

static uint8_t g_special_toggle_flag = 0;

/* ============= 被動模式相關定義 ============= */
typedef enum {
    MODE_PASSIVE_IDLE,      // 被動等待模式（GPIO 低位，等待接收）
    MODE_PASSIVE_ACK,       // 被動 ACK 模式（準備接收第二個 frame）
    MODE_ACTIVE             // 主動傳輸模式（GPIO 高位）
} spi_operation_mode_t;

static volatile spi_operation_mode_t operation_mode = MODE_PASSIVE_IDLE;
static uint8_t passive_rx_buffer[FIXED_BUFFER_SIZE] = {0};  // 保存被動模式收到的 [AA 11 11 CS]
static uint8_t passive_ff_buffer[FIXED_BUFFER_SIZE] = {0xFF, 0xFF, 0xFF, 0xFF};  // 被動模式回傳用
static volatile bool passive_mode_busy = false;  // 表示被動模式正在處理中

/* 三組數據緩衝區 */
static uint8_t dataFrame1[FIXED_BUFFER_SIZE] = {0xAA, 0x00, 0x04, 0x00};
static uint8_t dataFrame2[FIXED_BUFFER_SIZE] = {0xAA, 0x00, 0x21, 0x00};
static uint8_t dataFrame3[FIXED_BUFFER_SIZE] = {0xFF, 0xFF, 0xFF, 0xFF};

static uint8_t dynamicFrameBuffer[MAX_FRAME_SIZE] = {0};
static uint8_t destBuff[MAX_FRAME_SIZE] = {0};
static volatile uint32_t currentFrameSize = 0;

static uint32_t txIndex = 0;
static uint32_t rxIndex = 0;
static volatile bool spi_irq_enabled = false;

static volatile uint8_t currentFrame = 0;
static uint8_t* currentSrcBuff = NULL;

/* event bits */
#define EVT_TRANSFER_DONE (1UL << 0)
#define EVT_ALL_FRAMES_DONE (1UL << 1)
#define EVT_PASSIVE_RX_DONE (1UL << 2)
#define EVT_PASSIVE_NEED_INIT (1UL << 3)
#define EVT_BUTTON_EVENT (1UL << 4)

static EventGroupHandle_t button_event_group = NULL;
static EventGroupHandle_t spi_event_group = NULL;
static SemaphoreHandle_t spi_semaphore = NULL;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void button_task(void *pvParameters);
static void console_task(void *pvParameters);
static void spi_task(void *pvParameters);
static void passive_handler_task(void *pvParameters);
static void SPI_StartFrame_PreloadTX(uint8_t* srcBuff, uint32_t frameSize);
static inline void SPI_EnableRxTxInterrupt(void);
static inline void SPI_DisableRxTxInterrupt(void);
static uint8_t calculateChecksum(uint8_t* data, uint8_t len);
static void init_passive_mode(void);

/*******************************************************************************
 * Code
 ******************************************************************************/
static uint8_t calculateChecksum(uint8_t* data, uint8_t len)
{
    uint8_t count = 0;
    for (uint8_t i = 0; i < len; i++)
    {
        uint8_t byte = data[i];
        for (uint8_t j = 0; j < 8; j++)
        {
            if (byte & (1 << j))
            {
                count++;
            }
        }
    }
    return count;
}

static inline void SPI_EnableRxTxInterrupt(void)
{
    SPI_EnableInterrupts(EXAMPLE_SPI_SLAVE, kSPI_TxLvlIrq | kSPI_RxLvlIrq);
    spi_irq_enabled = true;
    if (operation_mode == MODE_ACTIVE) {
        PRINTF("SPI Enable() - Frame %d\r\n", currentFrame + 1);
    }
}

static inline void SPI_DisableRxTxInterrupt(void)
{
    SPI_DisableInterrupts(EXAMPLE_SPI_SLAVE, kSPI_TxLvlIrq | kSPI_RxLvlIrq);
    spi_irq_enabled = false;
    if (operation_mode == MODE_ACTIVE) {
        PRINTF("SPI Disable() - Frame %d complete\r\n", currentFrame + 1);
    }
}

static void SPI_StartFrame_PreloadTX(uint8_t* srcBuff, uint32_t frameSize)
{
    /* Clear RX FIFO */
    while (SPI_GetStatusFlags(EXAMPLE_SPI_SLAVE) & kSPI_RxNotEmptyFlag)
    {
        (void)SPI_ReadData(EXAMPLE_SPI_SLAVE);
    }

    currentFrameSize = frameSize;
    if (currentFrameSize > MAX_FRAME_SIZE)
    {
        currentFrameSize = MAX_FRAME_SIZE;
    }

    txIndex = currentFrameSize;
    rxIndex = currentFrameSize;
    currentSrcBuff = srcBuff;

    /* Preload TX FIFO */
    while ((txIndex > 0U) && (SPI_GetStatusFlags(EXAMPLE_SPI_SLAVE) & kSPI_TxNotFullFlag))
    {
        SPI_WriteData(EXAMPLE_SPI_SLAVE, currentSrcBuff[currentFrameSize - txIndex], 0);
        txIndex--;
    }
}

/* 初始化被動模式 */
static void init_passive_mode(void)
{
    if (operation_mode != MODE_ACTIVE && !passive_mode_busy) {
        operation_mode = MODE_PASSIVE_IDLE;
        SPI_StartFrame_PreloadTX(passive_ff_buffer, FIXED_BUFFER_SIZE);

        if (!spi_irq_enabled) {
            SPI_EnableRxTxInterrupt();
        }
    }
}

void SPI_SLAVE_IRQHandler(void)
{
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if ((SPI_GetStatusFlags(EXAMPLE_SPI_SLAVE) & kSPI_RxNotEmptyFlag) && (rxIndex > 0U))
    {
        destBuff[currentFrameSize - rxIndex] = SPI_ReadData(EXAMPLE_SPI_SLAVE);
        rxIndex--;
    }

    if ((SPI_GetStatusFlags(EXAMPLE_SPI_SLAVE) & kSPI_TxNotFullFlag) && (txIndex > 0U))
    {
        SPI_WriteData(EXAMPLE_SPI_SLAVE, currentSrcBuff[currentFrameSize - txIndex], 0);
        txIndex--;
    }

    if ((rxIndex == 0U) && (txIndex == 0U))
    {
        SPI_DisableRxTxInterrupt();

        /* 處理不同模式 */
		if (operation_mode == MODE_PASSIVE_IDLE)
		{
			// 被動模式：收到第一個 frame
			passive_mode_busy = true;

			// 步驟 1: 只檢查首碼是否為 0xAA
			if (destBuff[0] == 0xAA)
			{
				// 步驟 2: 驗證 checksum
				uint8_t expected_cs = calculateChecksum(destBuff, 3);
				if (destBuff[3] == expected_cs)
				{
					// 驗證通過，保存收到的任何有效資料
					memcpy(passive_rx_buffer, destBuff, FIXED_BUFFER_SIZE);
					PRINTF("\n[Passive] Received valid frame [%02X %02X %02X %02X], will send back on next transaction.\r\n",
						   passive_rx_buffer[0], passive_rx_buffer[1], passive_rx_buffer[2], passive_rx_buffer[3]);

