gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_freertos_event_spi_cm33/source/freertos_event.c
					// 切換到 ACK 模式，準備回傳剛剛保存的資料
					operation_mode = MODE_PASSIVE_ACK;
					SPI_StartFrame_PreloadTX(passive_rx_buffer, FIXED_BUFFER_SIZE);

					if (!spi_irq_enabled) {
						SPI_EnableRxTxInterrupt();
					}

					SDK_ISR_EXIT_BARRIER;
					return; // 處理完畢，直接返回
				}
				else
				{
					// Checksum 錯誤
					PRINTF("\n[Passive] Invalid checksum! Prefix OK, but expected %02X, got %02X\r\n", expected_cs, destBuff[3]);
					passive_mode_busy = false;
					xEventGroupSetBitsFromISR(spi_event_group, EVT_PASSIVE_NEED_INIT, &xHigherPriorityTaskWoken);
				}
			}
			else
			{
				// 首碼不是 0xAA，視為無效資料
				PRINTF("\n[Passive] Invalid frame prefix! Expected 0xAA, got 0x%02X\r\n", destBuff[0]);
				passive_mode_busy = false;
				xEventGroupSetBitsFromISR(spi_event_group, EVT_PASSIVE_NEED_INIT, &xHigherPriorityTaskWoken);
			}
		}
        else if (operation_mode == MODE_PASSIVE_ACK)
        {
            // 被動模式：收到第二個 frame (ACK)
            if (destBuff[0] == 0x11 && destBuff[1] == 0x11 &&
                destBuff[2] == 0x11 && destBuff[3] == 0x11)
            {
                PRINTF("[Passive] Received ACK [11 11 11 11], sent back [%02X %02X %02X %02X]\r\n",
                       passive_rx_buffer[0], passive_rx_buffer[1],
                       passive_rx_buffer[2], passive_rx_buffer[3]);
                PRINTF("[Passive] Sequence completed successfully!\r\n\n");
            }
            else
            {
                PRINTF("[Passive] Unexpected ACK: [%02X %02X %02X %02X]\r\n",
                       destBuff[0], destBuff[1], destBuff[2], destBuff[3]);
            }

            // 完成被動序列，回到等待狀態
            passive_mode_busy = false;
            operation_mode = MODE_PASSIVE_IDLE;
            xEventGroupSetBitsFromISR(spi_event_group, EVT_PASSIVE_RX_DONE | EVT_PASSIVE_NEED_INIT, &xHigherPriorityTaskWoken);
        }
        else if (operation_mode == MODE_ACTIVE)
        {
            // 主動模式
            xEventGroupSetBitsFromISR(spi_event_group, EVT_TRANSFER_DONE, &xHigherPriorityTaskWoken);
        }

#if USE_SEMAPHORE
        xSemaphoreGiveFromISR(spi_semaphore, &xHigherPriorityTaskWoken);
#endif
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }

    SDK_ISR_EXIT_BARRIER;
}

/* 被動處理任務 */
static void passive_handler_task(void *pvParameters)
{
    EventBits_t bits;

    // 初始化被動模式
    vTaskDelay(pdMS_TO_TICKS(100));
    init_passive_mode();

    while (1)
    {
        bits = xEventGroupWaitBits(spi_event_group,
                                   EVT_PASSIVE_RX_DONE | EVT_PASSIVE_NEED_INIT,
                                   pdTRUE,
                                   pdFALSE,
                                   portMAX_DELAY);

        if (bits & EVT_PASSIVE_NEED_INIT)
        {
            vTaskDelay(pdMS_TO_TICKS(10));

            // 只有在 GPIO 低位且不在主動模式時才初始化
            if (GPIO_PinRead(GPIO, 0, 29) == 0 && operation_mode != MODE_ACTIVE)
            {
                init_passive_mode();
            }
        }

        if (bits & EVT_PASSIVE_RX_DONE)
        {
            PRINTF("[Passive] Ready for next sequence.\r\n");
        }
    }
}

static void console_task(void *pvParameters)
{
    uint8_t hex_value;

    dataFrame1[3] = calculateChecksum(dataFrame1, 3);
    dataFrame2[3] = calculateChecksum(dataFrame2, 3);

    PRINTF("=== SPI Slave Ready ===\r\n");
    PRINTF("GPIO is LOW: Passive mode active, waiting for Master...\r\n");
    PRINTF("Initial Frame 1: [%02X %02X %02X %02X]\r\n",
           dataFrame1[0], dataFrame1[1], dataFrame1[2], dataFrame1[3]);
    PRINTF("Initial Frame 2: [%02X %02X %02X %02X]\r\n",
           dataFrame2[0], dataFrame2[1], dataFrame2[2], dataFrame2[3]);
    PRINTF("Initial Frame 3: [%02X %02X %02X %02X]\r\n",
           dataFrame3[0], dataFrame3[1], dataFrame3[2], dataFrame3[3]);

    while (1)
    {
        PRINTF("Input a byte to start active transmission (current flag is %d):\r\n", g_special_toggle_flag);

        do {
            hex_value = (uint8_t)GETCHAR();
        } while (hex_value == '\r' || hex_value == '\n');

        PRINTF("You typed: 0x%02X\r\n", hex_value);

        /* ============= 進入主動模式 ============= */
        // 1. 先停止被動模式
        operation_mode = MODE_ACTIVE;

        // 2. 停用 SPI 中斷
        SPI_DisableRxTxInterrupt();

        // 3. 等待任何進行中的被動傳輸完成
        while (passive_mode_busy) {
            vTaskDelay(pdMS_TO_TICKS(10));
        }

        // 4. 重新初始化 SPI 來清空 FIFO
        spi_slave_config_t slave_config = {0};
        SPI_SlaveGetDefaultConfig(&slave_config);
        slave_config.sselPol = (spi_spol_t)EXAMPLE_SPI_SPOL;
        SPI_Deinit(EXAMPLE_SPI_SLAVE);
        SPI_SlaveInit(EXAMPLE_SPI_SLAVE, &slave_config);

        // 5. 清空接收緩衝區
        memset(destBuff, 0, sizeof(destBuff));

        PRINTF(">>> FIFOs cleared for ACTIVE mode <<<\r\n");

        uint8_t frames_to_send = 3;
        bool trigger_frame2_was_sent = false;

        uint8_t* frame2_ptr = dataFrame2;
        uint32_t frame2_size = FIXED_BUFFER_SIZE;

        // 處理特殊的 0x92 輸入
        if (hex_value == TRIGGER_HEX_VALUE)
        {
            char input_str[MAX_FRAME_SIZE - 5] = {0};
            PRINTF("Please enter a string to send:\r\n");

            char ch;
            int i = 0;
            while ((ch = GETCHAR()) != '\r' && i < (sizeof(input_str) - 1))
            {
                PUTCHAR(ch);
                input_str[i++] = ch;
            }
            input_str[i] = '\0';
            PRINTF("\r\nString to send: %s\r\n", input_str);

            uint8_t str_len = strlen(input_str);

            dataFrame1[2] = str_len + 4;
            dataFrame1[3] = calculateChecksum(dataFrame1, 3);
            PRINTF("Updated Frame 1 for this transaction: [%02X %02X %02X %02X]\r\n",
                   dataFrame1[0], dataFrame1[1], dataFrame1[2], dataFrame1[3]);

            dynamicFrameBuffer[0] = 0xAA;
            dynamicFrameBuffer[1] = 0x00;
            dynamicFrameBuffer[2] = TRIGGER_HEX_VALUE;
            memcpy(&dynamicFrameBuffer[3], input_str, str_len);

            uint8_t checksum = calculateChecksum(dynamicFrameBuffer, 3 + str_len);
            dynamicFrameBuffer[3 + str_len] = checksum;

            frame2_ptr = dynamicFrameBuffer;
            frame2_size = 3 + str_len + 1;

