gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_freertos_event_spi_cm33/source/freertos_event.c
            PRINTF("Updated Dynamic Frame 2 (size %d): [", frame2_size);
            for(int j = 0; j < frame2_size; ++j) PRINTF("%02X ", frame2_ptr[j]);
            PRINTF("]\r\n");
        }
        else
        {
            dataFrame1[2] = 0x04;
            dataFrame1[3] = calculateChecksum(dataFrame1, 3);

            dataFrame2[2] = hex_value;
            dataFrame2[3] = calculateChecksum(dataFrame2, 3);

            if (hex_value == TRIGGER_FRAME2_VALUE)
            {
                trigger_frame2_was_sent = true;
                PRINTF("Frame 2 is the SPECIAL trigger frame [AA 00 23 CS]. Will check Frame 3 RX for response.\r\n");
            }

            frame2_ptr = dataFrame2;
            frame2_size = FIXED_BUFFER_SIZE;

            PRINTF("Updated Fixed Frame 2: [%02X %02X %02X %02X]\r\n",
                   dataFrame2[0], dataFrame2[1], dataFrame2[2], dataFrame2[3]);
        }

        currentFrame = 0;
        SPI_StartFrame_PreloadTX(dataFrame1, FIXED_BUFFER_SIZE);

        GPIO_PinWrite(GPIO, 0, 29, 1);
        PRINTF(">>> Entering ACTIVE mode: GPIO pin set HIGH <<<\r\n");

        if (!spi_irq_enabled)
        {
            SPI_EnableRxTxInterrupt();
        }

        for (int i = 0; i < frames_to_send; i++)
        {
#if USE_EVENT
            xEventGroupWaitBits(spi_event_group,
                                EVT_TRANSFER_DONE,
                                pdTRUE,
                                pdFALSE,
                                portMAX_DELAY);
#endif
            uint8_t* sent_frame_ptr;
            uint32_t sent_frame_size;

            if (currentFrame == 0) {
                sent_frame_ptr = dataFrame1;
                sent_frame_size = FIXED_BUFFER_SIZE;
            } else if (currentFrame == 1) {
                sent_frame_ptr = frame2_ptr;
                sent_frame_size = frame2_size;
            } else {
                sent_frame_ptr = dataFrame3;
                sent_frame_size = FIXED_BUFFER_SIZE;
            }

            PRINTF("Frame %d sent (size %d): [", currentFrame + 1, sent_frame_size);
            for(int j = 0; j < sent_frame_size; ++j) PRINTF("%02X ", sent_frame_ptr[j]);
            PRINTF("]\r\n");

            PRINTF("RX from master (size %d): [", sent_frame_size);
            for(int j = 0; j < sent_frame_size; ++j) PRINTF("%02X ", destBuff[j]);
            PRINTF("]\r\n");

            if (currentFrame == 2)
            {
                if (sent_frame_size >= 2)
                {
                    if (destBuff[0] == 0xAA)
                    {
                        PRINTF("Frame 3 RX prefix check: PASSED (0xAA).\r\n");

                        uint8_t receivedChecksum = destBuff[sent_frame_size - 1];
                        uint8_t calculatedChecksum = calculateChecksum(destBuff, sent_frame_size - 1);

                        if (receivedChecksum == calculatedChecksum)
                        {
                            PRINTF("Frame 3 RX checksum check: PASSED (Received: 0x%02X, Calculated: 0x%02X).\r\n",
                                   receivedChecksum, calculatedChecksum);
                        }
                        else
                        {
                            PRINTF("Frame 3 RX checksum check: FAILED (Received: 0x%02X, but expected: 0x%02X).\r\n",
                                   receivedChecksum, calculatedChecksum);
                        }
                    }
                    else
                    {
                        PRINTF("Frame 3 RX prefix check: FAILED (Expected: 0xAA, Received: 0x%02X).\r\n", destBuff[0]);
                    }
                }
                else
                {
                    PRINTF("Frame 3 RX check: SKIPPED (Frame size %d is too small for validation).\r\n", sent_frame_size);
                }

                if (trigger_frame2_was_sent)
                {
                    if (sent_frame_size == 4 && destBuff[0] == 0xAA &&
                        destBuff[1] == 0x00 && destBuff[2] == 0x02)
                    {
                        uint8_t calculated_cs = calculateChecksum(destBuff, 3);
                        if (destBuff[3] == calculated_cs)
                        {
                            PRINTF(">>> Special condition MET! Frame 2 was trigger, and received valid Frame 3 response.\r\n");
                            g_special_toggle_flag = !g_special_toggle_flag;
                            PRINTF(">>> g_special_toggle_flag is now: %d\r\n", g_special_toggle_flag);
                        }
                        else
                        {
                            PRINTF(">>> Special condition: Frame 3 response received, but CHECKSUM FAILED.\r\n");
                        }
                    }
                    else
                    {
                        PRINTF(">>> Special condition: Frame 2 was trigger, but Frame 3 response is not [AA 00 02 CS].\r\n");
                    }
                }
            }

            currentFrame++;

            if (currentFrame < frames_to_send)
            {
                if (currentFrame == 1)
                    SPI_StartFrame_PreloadTX(frame2_ptr, frame2_size);
                else if (currentFrame == 2)
                    SPI_StartFrame_PreloadTX(dataFrame3, FIXED_BUFFER_SIZE);

                if (!spi_irq_enabled)
                {
                    SPI_EnableRxTxInterrupt();
                }
            }
        }

        GPIO_PinWrite(GPIO, 0, 29, 0);
        PRINTF(">>> Active transmission done! GPIO pin set LOW <<<\r\n");
        PRINTF(">>> Returning to PASSIVE mode...\r\n\n");

        operation_mode = MODE_PASSIVE_IDLE;
        xEventGroupSetBits(spi_event_group, EVT_PASSIVE_NEED_INIT);

        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

static void spi_task(void *pvParameters)
{
    EventBits_t bits;
    while (1)
    {
        bits = xEventGroupWaitBits(spi_event_group,
                                   EVT_TRANSFER_DONE,
                                   pdTRUE,
                                   pdFALSE,
                                   portMAX_DELAY);
        if ((bits & EVT_TRANSFER_DONE) != 0)
        {
            PRINTF("spi_task: Frame transfer done.\r\n");
        }
    }
}

static void button_task(void *pvParameters)
{
    const TickType_t double_click_gap = pdMS_TO_TICKS(300);
    const TickType_t long_press_ticks = pdMS_TO_TICKS(1000);

    TickType_t last_press_time = 0;
    TickType_t press_start_time = 0;

    bool is_pressed = false;
    bool short_press_pending = false;
    bool double_click_detected = false;  // 雙擊旗標

    while (1)
    {
        int pin_state = GPIO_PinRead(GPIO, FUN_KEY1_N_PORT, FUN_KEY1_N_PIN);
        TickType_t now = xTaskGetTickCount();

        if (pin_state == 0 && !is_pressed) {
            is_pressed = true;

            if ((now - last_press_time) < double_click_gap) {
                // 雙擊偵測
                PRINTF("[Button] Double Click detected \r\n");
                short_press_pending = false;
                double_click_detected = true;  // 設置雙擊旗標
            }

            last_press_time = now;
            press_start_time = now;
        }
        else if (pin_state == 1 && is_pressed) {
            is_pressed = false;

            TickType_t press_duration = now - press_start_time;
            if (press_duration >= long_press_ticks) {
                PRINTF("[Button] Long Press detected \r\n");
                short_press_pending = false;
            } else {
                if (!double_click_detected) {
                    // 只有非雙擊時才標記短按候選
                    short_press_pending = true;
                    last_press_time = now;
                }
            }
        }

        // 短按候選超時檢查
        if (short_press_pending && (now - last_press_time) > double_click_gap) {
            PRINTF("[Button] Short Press detected\r\n");
            short_press_pending = false;
        }

        // 雙擊旗標超時清除（避免下一次按下被誤認為雙擊）
        if (double_click_detected && (now - last_press_time) > double_click_gap) {
            double_click_detected = false;
        }

        vTaskDelay(pdMS_TO_TICKS(10));
    }
}


static void Scan_I2C_Devices(I3C_Type *base)
{
    uint8_t dummyData = 0x00;
    status_t result;

    PRINTF("[I2C]Scanning I2C addresses...\n");

